#!/usr/bin/env python 
# -*- coding: utf-8 -*-
"""
-------------------------------------------------
   File Name：     makerbean_HW_21
   Description :
   Author :        Tommy
   date：          2018/2/12
-------------------------------------------------
   Change Activity:
                   2018/2/12:
-------------------------------------------------
"""
#2018个生肖运势字典
sheng_xiao_yun_shi = {
    "鼠":"属鼠人2018年求名有运，吉星对事业工作和学习考试有一定的助力。但求财不利，努力才有回报。又年逢三大凶星，要提防意外伤身之灾，关注家中长辈健康，幸好“天解”相助，可凭借努力和耐性战胜困难。",
    "牛":"属牛人2018年“天乙”、“国印”鼎力相助，整体运势不错。但丑戌相刑为犯太岁，运势遭破坏，财不聚守，防官司诉讼。且丑戌为墓不利平安健康。今年以求稳为主，不宜欲求太过，广觅机缘，扩大社交圈。",
    "虎":"属虎人2018年寅戌拱合，事业亨通。贵人暗中扶持，事业工作必有发展，财运有助，无往不利，可喜可贺。但年逢大凶星“白虎”，一年四季不太平，主意外不测不灾，当心伤灾病灾、小人暗害，应多加防范。",
    "兔":"属兔人2018年与太岁六合，看上去贵人相助，实则伴君如伴虎，吉凶难测。又年逢“小耗”与“死符”同宫，当心健康恶化，预防财运彻底破坏。好在年逢两大吉星相助，逢凶化吉，宜平常心面对，见好就收。",
    "龙":"属龙人2018年正冲太岁，又水火对冲，犯太岁最严重！且凶星云集，吉星无力，官灾很重，财运大破，诸事不利！凡事宜多加忍耐，忌急功近利，诚信为本，维系好人缘，适当做好化解。如有计划可办喜事。",
    "蛇":"属蛇人2018年逢“龙德”及“红鸾”相助，运势不错，桃花旺盛。年逢“暴败”、“天厄”，注意开源节流，避免意气之争，小病小耗大抵可逢凶化吉。凡事应量力而行，多结交良朋益友，用诚实可靠之人。",
    "马":"属马人2018年与太岁三合，又有多颗吉星入命，贵人扶助，运势顺畅。但年逢“白虎”、“披头”，官灾小人很重，不做违法之事，不惹是非，远离小人。遇事虽然多有波折，但只要全力以赴，把握时机，必有所获。",
    "羊":"属羊人2018年为破太岁，健康不利，且年逢“绞煞”凶星，易破财败运。虽“天德”入命，但动能不强。今年压力较大，应紧随贵人，任劳任怨，克服障碍，以守为攻是上策，最终能守得云开见月明。",
    "猴":"属猴人2018年负能量较多，平安福报受损。家运及年长病弱者健康不利，多惊多险，注意安全。年逢“驿马”，动中生财，劳有所获，事虽艰难，宜做好心理准备，养精蓄锐，等待时机，自会有时来运转之机。",
    "鸡":"属鸡人2018年太岁相害，是非小人多，闲事不管，莫做口舌之争。且今年无吉星入命，凡事多生波折，心情也因此感到压抑闹心。女性防桃花风波。年逢“病符”凶星，平时需注意身体健康，提防意外伤害。",
    "狗":"属狗人2018年本命年值太岁，再遇三大凶星入命，吉星助力疲弱，运势动荡难安。外出远行避免，倍加注意安全，多留意家人身体健康。年初做好化解，凡事低调冷静，闲事不管，事不强求，以免惊醒太岁。",
    "猪":"属猪人2018年四颗凶星云集，天时不利，运势不畅，凶多吉少。晦气入命宫，犯之身体欠安，易惹病灾，诸事不顺，注意健康出现毛病。吃苦耐劳是今年求名求利的唯一途径，树立信心和勇气，千万不能懒惰。"
}
year = input("根据您的出生年份，预测您2018年的运势。例如您是2001年出生的，请输入2001。\n请输入您的出生年份：")

#判断输入的是否是四位数字，且年份小于2019
while not (year.isdigit() and len(year) == 4 and (int(year) < 2019)):
    year = input("请正确输入您的出生年份小于2019。(例如：2001 )：")

#根据年份算出生肖
sheng_xiao = '猴鸡狗猪鼠牛虎兔龙蛇马羊'[(int(year))%12]

#根据属相输出2018运势
print("\n您的属相是%s。\n%s"%(sheng_xiao,sheng_xiao_yun_shi[sheng_xiao]))


